In [53]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [54]:
from sqlalchemy import create_engine

In [55]:
engine =  create_engine('postgresql://airflow:airflow@host.docker.internal:5432/airflow')

In [56]:
import pandas as pd

In [70]:
pd.read_sql("SELECT table_name,column_name,data_type FROM  information_schema.columns WHERE TABLE_NAME='fact_movies'",engine)

    table_name   column_name data_type
0  fact_movies       id_date   integer
1  fact_movies  id_cast_crew   integer
2  fact_movies         title      text
3  fact_movies          date      text

In [71]:
pd.read_sql("SELECT table_name,column_name,data_type FROM  information_schema.columns WHERE TABLE_NAME='movie_ratings'",engine)

      table_name  column_name         data_type
0  movie_ratings       rating  double precision
1  movie_ratings   vote_count  double precision
2  movie_ratings  title_movie              text
3  movie_ratings        genre              text

In [72]:
pd.read_sql("SELECT table_name,column_name,data_type FROM  information_schema.columns WHERE TABLE_NAME='dates'",engine)

  table_name column_name          data_type
0      dates     id_date            integer
1      dates       month            integer
2      dates     quarter            integer
3      dates        year            integer
4      dates        date  character varying

In [73]:
pd.read_sql("SELECT table_name,column_name,data_type FROM  information_schema.columns WHERE TABLE_NAME='cast_and_crew'",engine)

      table_name   column_name data_type
0  cast_and_crew  id_cast_crew   integer
1  cast_and_crew      director      text
2  cast_and_crew        actor1      text
3  cast_and_crew        actor2      text
4  cast_and_crew        actor3      text

In [31]:
pd.read_sql('SELECT * FROM fact_movies',engine)

                           title  id_date                 date  id_cast_crew
0            motherless brooklyn        1  2019-01-11 00:00:00             1
1        a million little pieces        2  2019-06-12 00:00:00             2
2            alita: battle angel        3  2019-02-14 00:00:00             3
3                        shazam!        4  2019-05-04 00:00:00             4
4                      Toy Story        5  1995-10-30 00:00:00             5
...                          ...      ...                  ...           ...
36379           House of Horrors    36380  1946-03-29 00:00:00         36380
36380  Shadow of the Blair Witch    36381  2000-10-22 00:00:00         36381
36381        The Burkittsville 7    36382  2000-10-03 00:00:00         36382
36382            Caged Heat 3000    36383  1995-01-01 00:00:00         36383
36383        Century of Birthing    36384  2011-11-17 00:00:00         36384

[36384 rows x 4 columns]

In [32]:
pd.read_sql('SELECT * FROM cast_and_crew',engine)

,id_cast_crew,director,actor1,actor2,actor3
0,1,Edward Norton,Edward Norton,Bruce Willis,Gugu Mbatha-Raw
1,2,Sam Taylor-Johnson,Aaron Taylor-Johnson,Billy Bob Thornton,Odessa Young
2,3,Robert Rodriguez,Rosa Salazar,Christoph Waltz,Jennifer Connelly
3,4,David F. Sandberg,Zachary Levi,Asher Angel,Mark Strong
4,5,John Lasseter,Tom Hanks,Tim Allen,Don Rickles
...,...,...,...,...,...
36379,36380,Jean Yarbrough,Rondo Hatton,Robert Lowery,Virginia Grey
36380,36381,Ben Rock,Tony Abatemarco,Andre Brooks,Mariclare Costello
36381,36382,Ben Rock,Monty Bane,Lucy Butler,David Grammer
36382,36383,Aaron Osborne,Lisa Boyle,Kena Land,Zaneta Polard
36383,36384,Lav Diaz,Angel Aquino,Perry Dizon,Hazel Orencio

In [33]:
pd.read_sql('SELECT * FROM movie_ratings',engine)

                     title_movie                    genre  rating  vote_count
0            motherless brooklyn      Crime Drama Mystery     6.8     45618.0
1        a million little pieces                    Drama     6.2      2005.0
2            alita: battle angel  Action Adventure Sci-Fi     7.3    232693.0
3                        shazam!  Action Adventure Comedy     7.0    266089.0
4                      Toy Story  Animation Comedy Family     7.7      5415.0
...                          ...                      ...     ...         ...
36379           House of Horrors  Horror Mystery Thriller     6.3         8.0
36380  Shadow of the Blair Witch           Mystery Horror     7.0         2.0
36381        The Burkittsville 7                   Horror     7.0         1.0
36382            Caged Heat 3000                   Sci-Fi     3.5         1.0
36383        Century of Birthing                    Drama     9.0         3.0

[36384 rows x 4 columns]

In [34]:
pd.read_sql('SELECT * FROM dates',engine)

       id_date                 date  month  quarter  year
0            1  2019-01-11 00:00:00      1        1  2019
1            2  2019-06-12 00:00:00      6        2  2019
2            3  2019-02-14 00:00:00      2        1  2019
3            4  2019-05-04 00:00:00      5        2  2019
4            5  1995-10-30 00:00:00     10        4  1995
...        ...                  ...    ...      ...   ...
36379    36380  1946-03-29 00:00:00      3        1  1946
36380    36381  2000-10-22 00:00:00     10        4  2000
36381    36382  2000-10-03 00:00:00     10        4  2000
36382    36383  1995-01-01 00:00:00      1        1  1995
36383    36384  2011-11-17 00:00:00     11        4  2011

[36384 rows x 5 columns]

In [75]:
pd.read_sql('SELECT fact_movies.title,rating,vote_count '
            'FROM movie_ratings JOIN fact_movies ON fact_movies.title=movie_ratings.title_movie '
            'WHERE vote_count>100 '
            'ORDER BY rating desc '
            'LIMIT 10 ',engine)

                                              title  rating  vote_count
0                       Dilwale Dulhania Le Jayenge     9.1       661.0
1                                     The Godfather     8.5      6024.0
2                          The Shawshank Redemption     8.5      8358.0
3                                        Your Name.     8.5      1030.0
4  Dear Zachary: A Letter to a Son About His Father     8.4       146.0
5                       Once Upon a Time in America     8.3      1104.0
6                                  Schindler s List     8.3      4436.0
7                                 Life Is Beautiful     8.3      3643.0
8                                      Pulp Fiction     8.3      8670.0
9                                            Psycho     8.3      2405.0

In [76]:
pd.read_sql('SELECT genre '
            'FROM movie_ratings JOIN fact_movies ON fact_movies.title=movie_ratings.title_movie '
            'WHERE vote_count>100 '
            'ORDER BY rating desc '
            'LIMIT 5 ',engine)

                     genre
0     Comedy Drama Romance
1              Drama Crime
2              Drama Crime
3  Romance Animation Drama
4        Crime Documentary

In [77]:
pd.read_sql('SELECT count(title) as movies,quarter '
            'FROM dates JOIN fact_movies ON fact_movies.id_date=dates.id_date '
            'GROUP BY quarter '
            'ORDER BY count(title) desc '
            'LIMIT 10 ',engine)

   movies  quarter
0    9774        4
1    9603        1
2    8970        3
3    8037        2

In [74]:
pd.read_sql('SELECT count(title) as movies,quarter '
            'FROM dates JOIN fact_movies ON fact_movies.id_date=dates.id_date '
            'GROUP BY quarter '
            'ORDER BY count(title) desc '
            'LIMIT 10 ',engine)

   movies  quarter
0    9774        4
1    9603        1
2    8970        3
3    8037        2

In [94]:
pd.read_sql('SELECT fact_movies.title,genre,rating,vote_count '
            'FROM movie_ratings JOIN fact_movies ON fact_movies.title=movie_ratings.title_movie JOIN dates ON fact_movies.id_date=dates.id_date '
            'WHERE dates.year>2000 '
            'ORDER BY vote_count desc  '
            'LIMIT 10 OFFSET 3 ',engine)

,title,genre,rating,vote_count
0,Inception,Action Thriller Sci-Fi Mystery Adventure,8.1,14075.0
1,The Dark Knight,Drama Action Crime Thriller,8.3,12269.0
2,Avatar,Action Adventure Fantasy Sci-Fi,7.2,12114.0
3,Deadpool,Action Adventure Comedy,7.4,11444.0
4,Interstellar,Adventure Drama Sci-Fi,8.1,11187.0
5,Django Unchained,Drama Western,7.8,10297.0
6,Guardians of the Galaxy,Action Sci-Fi Adventure,7.9,10014.0
7,The Hunger Games,Sci-Fi Adventure Fantasy,6.9,9634.0
8,Mad Max: Fury Road,Action Adventure Sci-Fi Thriller,7.3,9629.0
9,The Dark Knight Rises,Action Crime Drama Thriller,7.6,9263.0